console.log("Привет мир!"); // Вывод работающего кода в консоль
2 + 2

// Не трогать! Оно работает, значит так надо
/*
    Это - большой многострочный комментарий!
*/

/* 
    Типы данных в JavaScript
    В ES5 - 6 типов данных
    5 - простых (тривиальных)
    1 - сложный (составной)
*/

/*
    Number (числовой тип данных)
    8
    0
    -9
    3.45
    -9.43
    5.43.789 - ошибочка! Это не число!
    6,4 - так нельзя!

    Операторы для чисел
    +   сложение
    -   вычитание
    *   умножение
    /   деление
    %   остаток от деления (4 % 3 => 1)
    **  возведение в степень (2 ** 3 => 8) 
                             (4 ** 1/2 => 2) - корень из двух
*/


// Есть 8 студентов
// Есть 15 яблок
// Сколько яблок можно дать каждому студенту?

let students; // объявление переменной
let apples; 

// let students, apples;
// ctrl+/ (cmd+/)

students = 8